In [1]:
# Import the SQL database into Pandas
# Import Dependencies
%matplotlib notebook
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from config import password

In [2]:
#Create an engine to SQL databases
from sqlalchemy import create_engine
engine = create_engine(f"postgresql://postgres:{password}@localhost:5432/SQL_Challenge")
connect = engine.connect()

In [3]:
#Query to test records for SQL DB
employee_db = pd.read_sql("select * from employees", connect)
employee_db.head()

   emp_no emp_title  birth_date  first_name  last_name sex   hire_date
0  473302     s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053     e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444     e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786     s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238     e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [4]:
#Query for Salary and employee number
salary_db = pd.read_sql("select * from salaries", connect)
salary_db["salary"] = salary_db["salary"].map("${:,.2f}".format)
salary_db.head()

   emp_no      salary
0   10001  $60,117.00
1   10002  $65,828.00
2   10003  $40,006.00
3   10004  $40,054.00
4   10005  $78,228.00

In [ ]:
# Create a histogram to visualize the most common salary ranges for employees.
plt.hist(salary_db['salary'], 20, density=False, label="Salary")
plt.axvline(salary_db['salary'].mean(), color='k', linestyle='dashed', linewidth=1, label="Salary Mean")
plt.xlabel("Salary")
plt.ylabel("Number of Employees")
plt.legend() 
plt.title("Common Salary Ranges")

In [ ]:
# Merge employee_db & salary_db  on emp_no
emp_salary = pd.merge(employee_db, salary_db, how="left", on=["emp_no", "emp_no"])
emp_salary.head()

In [ ]:
titles_db = pd.read_sql("select * from titles", connect)
titles_db.rename(columns={"title_id":"emp_title"}, inplace=True)
titles_db.head()

In [ ]:
employee_salary = pd.merge(emp_salary, titles_db, how="inner", on =["emp_title", "emp_title"])
employee_salary.head()